In [1]:
import pandas as pd

In [2]:
# dataframe

data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}

countries = pd.DataFrame(data)
countries = countries.set_index('country')   # 인덱스 지정
countries

                population    area    capital
country
Belgium               11.3   30510   Brussels
France                64.3  671308      Paris
Germany               81.3  357050     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

---

<div class="alert alert-success">
    <b>EXERCISE</b>: 인구밀도를 의미하는 `density` 칼럼을 추가하세요. (주의: 현재 'population' 칼럼은 100만 단위로 표기되어 있습니다)  
  
</div>

density (밀도) = population * 1,000,000 / area

In [4]:
(11.3 * 1000000) / 30510

370.3703703703704

In [5]:
countries['density'] = (countries['population'] * 1000000) / countries['area']

In [6]:
countries

                population    area    capital     density
country
Belgium               11.3   30510   Brussels  370.370370
France                64.3  671308      Paris   95.783158
Germany               81.3  357050     Berlin  227.699202
Netherlands           16.9   41526  Amsterdam  406.973944
United Kingdom        64.9  244820     London  265.092721

<div class="alert alert-success">
    <b>EXERCISE</b>: 인구밀도가 300을 초과하는 국가(country)의 수도(capital)과 인구(population)을 선택해주세요.  
  
</div>

In [57]:
countries.loc[countries['density'] > 300, ['capital', 'population']]

               capital  population
country
Belgium       Brussels        11.3
Netherlands  Amsterdam        16.9

<div class="alert alert-success">
    <b>EXERCISE</b>: 'density_ratio' 칼럼을 추가해주세요. (density_ratio = 인구밀도/평균 인구밀도)
</div>

In [15]:
countries['density_ratio'] = (countries['density'] / countries['density'].mean())

In [16]:
countries

                population    area    capital     density  density_ratio
country
Belgium               11.3   30510   Brussels  370.370370       1.355755
France                64.3  671308      Paris   95.783158       0.350618
Germany               81.3  357050     Berlin  227.699202       0.833502
Netherlands           16.9   41526  Amsterdam  406.973944       1.489744
United Kingdom        64.9  244820     London  265.092721       0.970382

<div class="alert alert-success">
    <b>EXERCISE</b>: 영국(United Kingdom)의 수도(capital)를 'Cambridge'로 변경해주세요.
</div>

In [17]:
countries['capital'] = countries['capital'].str.replace("London", "Cambridge")

In [18]:
countries

                population    area    capital     density  density_ratio
country
Belgium               11.3   30510   Brussels  370.370370       1.355755
France                64.3  671308      Paris   95.783158       0.350618
Germany               81.3  357050     Berlin  227.699202       0.833502
Netherlands           16.9   41526  Amsterdam  406.973944       1.489744
United Kingdom        64.9  244820  Cambridge  265.092721       0.970382

<div class="alert alert-success">
    <b>EXERCISE</b>: 인구 밀도가 100 초과, 300 미만인 국가들을 표시해주세요.  
</div>

In [21]:
countries.loc[(countries['density'] > 100) & (countries['density'] < 300) ,'capital']

country
Germany              Berlin
United Kingdom    Cambridge
Name: capital, dtype: object

<div class="alert alert-success">
    <b>EXERCISE</b>: 수도가 7글자 이상인 국가들을 표시해주세요. (힌트: string의 len( )를 사용하세요.)
</div>

In [24]:
countries['capital']

country
Belgium            Brussels
France                Paris
Germany              Berlin
Netherlands       Amsterdam
United Kingdom    Cambridge
Name: capital, dtype: object

In [27]:
countries.loc[countries['capital'].str.len() >= 7, 'capital']

country
Belgium            Brussels
Netherlands       Amsterdam
United Kingdom    Cambridge
Name: capital, dtype: object

<div class="alert alert-success">
    <b>EXERCISE</b>: 수도에 'am' 이 포함되는 국가들을 표시해주세요. (힌트: string의 contains( )를 사용하세요.)
</div>

In [28]:
countries.loc[countries['capital'].str.contains('am'), 'capital']

country
Netherlands       Amsterdam
United Kingdom    Cambridge
Name: capital, dtype: object

# 영화리뷰 데이터에서 자료 찾기

In [29]:
# from google.colab import drive
# # drive.mount('/content/drive')

ModuleNotFoundError: No module named 'google'

In [31]:
df = pd.read_csv('./data/movie_title_data.tsv', sep="\t")
df

C:\Users\5-05\AppData\Local\Temp\ipykernel_12492\2737272239.py:1: DtypeWarning: Columns (4,5) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('./data/movie_title_data.tsv', sep="\t")

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...
8407394,tt9916848,tvEpisode,Episode #3.17,Episode #3.17,0,2010,\N,\N,"Action,Drama,Family"
8407395,tt9916850,tvEpisode,Episode #3.19,Episode #3.19,0,2010,\N,\N,"Action,Drama,Family"
8407396,tt9916852,tvEpisode,Episode #3.20,Episode #3.20,0,2010,\N,\N,"Action,Drama,Family"
8407397,tt9916856,short,The Wind,The Wind,0,2015,\N,27,Short
8407398,tt9916880,tvEpisode,Horrid Henry Knows It All,Horrid Henry Knows It All,0,2014,\N,10,"Adventure,Animation,Comedy"

<div class="alert alert-success">
    <b>EXERCISE</b>: titles 데이터프레임에는 몇 개의 영화가 기록되어 있나요?
</div>

In [36]:
df['primaryTitle'].count()

8407385

<div class="alert alert-success">
    <b>EXERCISE</b>: titles에서 가장 빠른 시기에 제작된 영화 두 개를 표시하세요.  힌트: .sort_values()
</div>

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8407399 entries, 0 to 8407398
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 577.3+ MB

In [70]:
df['startYear'].unique()

array([1894, 1892, 1893, 1895, 1896, 1898, 1897, 1900, 1899, 1901, 1902,
       1903, 1905, 1904, 1912, 1907, 1906, 1908, 1910, 1909, 1914, 1911,
       1913, 1915, 1919, 1916, 1917, 1918, 1936, 1925, 1920, 1922, 1921,
       1923, 2019, 1924, 1928, 1926, 1927, 1929, 2000, 1993, 1935, 2014,
       1930, 1942, 1934, 1931, 1932, 1939, 1937, 1933, 1950, 1938, 1951,
       1945, 1946, 1996, 1940, 1944, 1949, 1947, 1941, 1952, 1970, 1957,
       1943, 1959, 1948, 2001, 1953, 2008, 1954, 1965, 1983, 1980, 1973,
       1961, 1995, 1955, 1962, 1958, 1956, 1977, 1960, 1964, 1967, 1968,
       1963, 1986, 1971, 1969, 1972, 1966, 2021, 2002, 1976, 1990, 2020,
       1979, 1974, 1978, 1981, 1988, 1975, 1989, '1971', '1972', '1970',
       '1974', '1973', '1976', '1969', '1968', '1985', '\\N', '1981',
       '2009', '1980', '1986', '1965', '1987', '1975', '1978', '1967',
       '1990', '1977', '2010', '2018', '1979', '2007', '1989', '1983',
       '1988', '1984', '1966', '1982', '1992', '1991', '1952', '1963',
       '2001', '1961', '1994', '1993', '1964', '1957', '1999', '1995',
       '2019', '2005', '1953', '2004', '1998', '1947', '2002', '1997',
       '1959', '1996', '2017', '2000', '1945', '1956', '2021', '2013',
       '2016', '2006', '2003', '1955', '1949', '2008', '1960', '1930',
       '1938', '1929', '1944', '1935', '1962', '1919', '1951', '1914',
       '1954', '1958', '1907', '1942', '1918', '1943', '1921', '1927',
       '1941', '1939', '1940', '1937', '1950', '1946', '1916', '1948',
       '1934', '1912', '1911', '1926', '1933', '1936', '1925', '1932',
       '1928', '1917', '1920', '1931', '1913', '1895', '1922', '1923',
       '1924', '1900', '1908', '1915', '1910', '1897', '1905', '1909',
       '1903', '1902', '1901', '1906', '1904', '1898', '1896', '1899',
       '2012', '2014', '2020', '2015', '2011', '1894', '1892', '1893',
       '1891', '1888', '1890', '2022', '1889', '2023', '2024', '2025',
       '2027', '2026', '2028', '1878', '1877', '1882', '1881', '1887',
       '1874', '1883', '1885'], dtype=object)

In [74]:
df['startYear'].str.replace("\\N", "0")

0           NaN
1           NaN
2           NaN
3           NaN
4           NaN
           ...
8407394    2010
8407395    2010
8407396    2010
8407397    2015
8407398    2014
Name: startYear, Length: 8407399, dtype: object

In [75]:
df['startYear'].astype('int')

ValueError: invalid literal for int() with base 10: '\\N'

In [76]:
df = df[df['startYear'] != '\\N']

In [77]:
df.loc[:,'startYear'] = df['startYear'].astype('int')

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7384286 entries, 0 to 8407398
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 563.4+ MB

In [80]:
df['startYear'] = df['startYear'].apply(int)

C:\Users\5-05\AppData\Local\Temp\ipykernel_12492\2061835706.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['startYear'] = df['startYear'].apply(int)

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7384286 entries, 0 to 8407398
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       int64
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: int64(1), object(8)
memory usage: 563.4+ MB

In [85]:
df.loc[df['startYear'].sort_values(ascending=True)]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
1874,tt0001894,short,Spike Shannon's Last Fight,Spike Shannon's Last Fight,0,1911,\N,\N,"Short,Western"
1877,tt0001897,short,The Stage Driver's Daughter,The Stage Driver's Daughter,0,1911,\N,\N,"Short,Western"
1878,tt0001898,short,A Stage Romance,A Stage Romance,0,1911,\N,\N,"Drama,Short"
1878,tt0001898,short,A Stage Romance,A Stage Romance,0,1911,\N,\N,"Drama,Short"
1881,tt0001901,short,The Stolen Dog,The Stolen Dog,0,1911,\N,\N,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...
2027,tt0002052,short,The Battleground,The Battleground,0,1912,\N,\N,"Drama,Short"
2027,tt0002052,short,The Battleground,The Battleground,0,1912,\N,\N,"Drama,Short"
2028,tt0002053,short,A Bear Escape,A Bear Escape,0,1912,\N,5,"Comedy,Short"
2028,tt0002053,short,A Bear Escape,A Bear Escape,0,1912,\N,5,"Comedy,Short"
2028,tt0002053,short,A Bear Escape,A Bear Escape,0,1912,\N,5,"Comedy,Short"

<div class="alert alert-success">
    <b>EXERCISE</b>: 제목(title)이 "Hamlet"인 영화는 몇 개가 있나요?
</div>

In [54]:
df['primaryTitle'].isna().sum()

14

In [58]:
df['primaryTitle'] = df['primaryTitle'].fillna('Unknown')

In [59]:
df['primaryTitle'].isna().sum()

0

In [60]:
df['primaryTitle'].value_counts()

primaryTitle
Episode #1.1                   41344
Episode #1.2                   37283
Episode #1.3                   35175
Episode #1.4                   31782
Episode #1.5                   28991
                               ...
4124                               1
The Terror of Buri: Part 2         1
Dog Crate                          1
B-15 Project: Girls Like Us        1
Horrid Henry Knows It All          1
Name: count, Length: 4000746, dtype: int64

In [64]:
df.loc[df['primaryTitle'].str.contains('Hamlet'), 'primaryTitle']

303                       Le duel d'Hamlet
594              Hamlet, Prince of Denmark
625                                 Hamlet
626                                 Hamlet
876              Hamlet, Prince of Denmark
                        ...
8114427               Ten Deaths of Hamlet
8182008         Hamlet Shakespeare's Globe
8235329    Hamlet Stanislawa Wyspianskiego
8306453                             Hamlet
8400053              Hamlet Poem Unlimited
Name: primaryTitle, Length: 430, dtype: object

In [63]:
df.loc[df['primaryTitle'].str.contains('Hamlet'), 'primaryTitle'].describe()

count        430
unique       278
top       Hamlet
freq         133
Name: primaryTitle, dtype: object

<div class="alert alert-success">
    <b>EXERCISE</b>: 제목(title)이 "Treasure Island"인 영화를 제작년도(year)의 오름차순에 따라 표시하세요
</div>

In [88]:
df['startYear'] = df['startYear'].apply(int)

C:\Users\5-05\AppData\Local\Temp\ipykernel_12492\2061835706.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['startYear'] = df['startYear'].apply(int)

In [89]:
filter_df = df.loc[df['primaryTitle'].str.contains('Treasure Island'), ['primaryTitle', 'startYear']]
filter_df

                                           primaryTitle  startYear
2511                                    Treasure Island       1912
9589                                    Treasure Island       1917
11620                                   Treasure Island       1920
12833              Colonel Heeza Liar's Treasure Island       1922
25459                                   Treasure Island       1934
...                                                 ...        ...
7719440  Rusty's Treasure Island/Rusty's Raptor-Sitting       2019
7720770                                 Treasure Island       2018
7844482           Spike Milligan on Treasure Island WC2       1961
7942445                Family Classics: Treasure Island       1966
8333379                                 Treasure Island       2011

[179 rows x 2 columns]

In [91]:
sorted_df = filter_df.sort_values(by='startYear', ascending=True)
sorted_df

                                 primaryTitle  startYear
4517005          The Story of Treasure Island       1908
2511                          Treasure Island       1912
5032142                       Treasure Island       1913
9589                          Treasure Island       1917
11620                         Treasure Island       1920
...                                       ...        ...
2986866  The Greatest Show on Treasure Island       2020
3809301                       Treasure Island       2021
3260461       Charlie Chan at Treasure Island       2021
2999333                Muppet Treasure Island       2021
2317588                      Treasure Islands       2022

[179 rows x 2 columns]

<div class="alert alert-success">
    <b>EXERCISE</b>: 1590년에서 1959년 사이 몇 개의 영화가 만들어졌나요?(1950 <= 제작년도 <= 1959)
</div>

In [95]:
df.loc[(df['startYear'] >= 1950) & (df['startYear'] <= 1959), ['primaryTitle', 'startYear']]

                                              primaryTitle  startYear
21275                                    Arizona Territory       1950
21712                                        Lebbra bianca       1951
25117                    El negro que tenía el alma blanca       1951
30454                              You're Only Young Twice       1952
31048    Made in Germany - Die dramatische Geschichte d...       1957
...                                                    ...        ...
8406493                    Morey Amsterdam, Charles Dingle       1951
8406548         Morey Amsterdam, Wally Brown, Ilona Massey       1952
8406554                   Morey Amsterdam, Sarah Churchill       1951
8406559  Morey Amsterdam, Wally Brown, Rosemary Clooney...       1952
8407125                              Paw Turns Over a Leaf       1952

[118649 rows x 2 columns]

In [96]:
len(df.loc[(df['startYear'] >= 1950) & (df['startYear'] <= 1959), ['primaryTitle', 'startYear']])

118649

# 타이타닉 자료에서 그룹별 연산하기

In [92]:
titanic = pd.read_csv("https://raw.githubusercontent.com/haram4th/ablearn/main/Taitanic_train.csv")

In [93]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

<div class="alert alert-success">
    <b>EXERCISE</b>: groupby()를 사용하여 각 성별(sex)의 평균 나이(age)를 구하세요.
</div>

In [102]:
titanic.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

<div class="alert alert-success">
    <b>EXERCISE</b>: 전체 승객(passenger)의 평균 생존율을 구하세요.
</div>

In [ ]:
titanic.groupby('Sex')['Age'].mean()

<div class="alert alert-success">
    <b>EXERCISE</b>: 25세 이하 승객의 생존율을 구하세요. (힌트: 불리언 인덱싱)
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 남성의 생존율을 구하세요. 여성의 생존율을 구하세요. (힌트: 불리언 인덱싱)
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 생존율을 구하는 함수가 작성되어 있습니다. 성별 생존율을 groupby를 활용해 구하기 위해 ?부분을 알맞게 채워주세요.
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: 'Pclass'별로 생존율을 보기 위해 bar 차트를 그리고자 합니다. ?부분을 알맞게 채워서 bar 차트를 그려주세요.
</div>